espressif/esp-idf/examples/system/efuse/sdkconfig.ci.virt_flash_enc_aes_256
# FLASH_ENCRYPTION with EFUSE_VIRTUAL_KEEP_IN_FLASH

# FLASH_ENCRYPTION_AES256 is available only in ESP32-S2
CONFIG_IDF_TARGET="esp32s2"

CONFIG_PARTITION_TABLE_OFFSET=0xC000
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="test/partitions_efuse_emul.csv"

CONFIG_SECURE_FLASH_ENC_ENABLED=y
CONFIG_SECURE_FLASH_ENCRYPTION_AES256=y

# IMPORTANT: ONLY VIRTUAL eFuse MODE!
CONFIG_EFUSE_VIRTUAL=y
CONFIG_EFUSE_VIRTUAL_KEEP_IN_FLASH=y
